KASTORPROJECT/src/DataProcessors/СинхронизацияСКадровымиСистемами/СинхронизацияСКадровымиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СинхронизацияСКадровымиСистемами</name>
</mdclass:DataProcessor>

KASTORPROJECT/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/DataProcessors/СинхронизацияСКадровымиСистемами/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьСотрудниковНаСервере()

    ТаблицаПользователей.Очистить();

    Выборка = Справочники.Сотрудники.Выбрать();

    Пока Выборка.Следующий() Цикл

        НоваяСтрока = ТаблицаПользователей.Добавить();

        НоваяСтрока.Добавить         = Ложь;
        НоваяСтрока.Сотрудник        = Выборка.Ссылка;
        НоваяСтрока.ЛогинAD          = Выборка.ЛогинAD;
        НоваяСтрока.Должность        = Выборка.Должность;
        НоваяСтрока.Подразделение    = Выборка.Подразделение;
        НоваяСтрока.Статус           = Выборка.Статус;
        НоваяСтрока.Уволен           = Выборка.Уволен;
        НоваяСтрока.ФизическоеЛицо   = Выборка.ФизическоеЛицо;

    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСотрудников(Команда)

    ЗагрузитьСотрудниковНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)

    Для каждого Стр Из ТаблицаПользователей Цикл
        Стр.Добавить = Истина;
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)

    Для каждого Стр Из ТаблицаПользователей Цикл
        Стр.Добавить = Ложь;
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьAD(Команда)

    СинхронизироватьADНаСервере();

    ЗагрузитьСотрудниковНаСервере();

    Сообщить("Синхронизация завершена");

КонецПроцедуры

&НаСервере
Процедура СинхронизироватьADНаСервере()

    Для каждого Стр Из ТаблицаПользователей Цикл

        Если НЕ Стр.Добавить Тогда
            Продолжить;
        КонецЕсли;

        Если НЕ ЗначениеЗаполнено(Стр.Сотрудник) Тогда
            Продолжить;
        КонецЕсли;

        Попытка

            ИнтеграцияAD.СинхронизироватьСотрудника(
                Стр.Сотрудник
            );

        Исключение

            Сообщить(
                "Ошибка: "
                + Стр.ЛогинAD
                + " / "
                + ОписаниеОшибки()
            );

        КонецПопытки;

    КонецЦикла;

КонецПроцедуры
